#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.io_com_cosmos_etl_func will be destroyed
  # (because azurerm_cosmosdb_sql_role_assignment.io_com_cosmos_etl_func is not in configuration)
  - resource "azurerm_cosmosdb_sql_role_assignment" "io_com_cosmos_etl_func" {
      - account_name        = "io-p-itn-com-cosno-01" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01/sqlRoleAssignments/e2008c75-740c-56b0-a3a6-d2015221dfc9" -> null
      - name                = "e2008c75-740c-56b0-a3a6-d2015221dfc9" -> null
      - principal_id        = "42a26240-ee65-4929-889d-f5fd6cafbe85" -> null
      - resource_group_name = "io-p-itn-com-rg-01" -> null
      - role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> null
      - scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01" -> null
    }

  # module.web_apps.azurerm_role_assignment.io_com_cosmos_etl_func will be created
  + resource "azurerm_role_assignment" "io_com_cosmos_etl_func" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "42a26240-ee65-4929-889d-f5fd6cafbe85"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Cosmos DB SQL Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01"
        name                                           = "io-p-itn-msgs-sending-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ sticky_settings {
          ~ app_setting_names       = [
              - "APPINSIGHTS_SAMPLING_PERCENTAGE",
                "SLOT_TASK_HUBNAME",
                "AzureFunctionsJobHost__extensions__durableTask__hubName",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
                "AzureFunctionsWebHost__hostid",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (30 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.web_apps.module.citizen_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-citizen-func-01"
        name                                           = "io-p-itn-com-citizen-func-01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.web_apps.module.citizen_func.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-citizen-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (30 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.web_apps.module.etl_func.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-com-etl-func-01] Health Check Failed"
        name                     = "io-p-itn-com-etl-func-01] Health Check Failed"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 5 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.storage_api_weu.azurerm_storage_container.message_content,
  on ../_modules/storage_accounts/storage_account_api.tf line 32, in resource "azurerm_storage_container" "message_content":
  32:   storage_account_name  = module.storage_api.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
